<?

//유입경로
$config['path'] = array (
		'L'=>'온라인',
		'T'=>'전화',
		'W'=>'워킹',
		'E'=>'기존고객',
		'Z'=>'메디코스(기존)',
		'1'=>'소개(원장)',
		'6'=>'소개(고객)',
		'5'=>'소개(직원)',
		'G'=>'에이전시',
		//'R'=>'리얼모델',			// 20170224 kruddo : 리얼모델 삭제
		'P'=>'실시간상담',
		'O'=>'온라인상담',
		'K'=>'카카오톡',
		'I'=>'직원',
		'Q'=>'기타'

		// 20170215 kruddo : 소개 목록 간소화 2+3->1, 4+5->5, 6->6
		//'1'=>'소개(박원장)',
		//'2'=>'소개(진원장)',
		//'3'=>'소개(신원장)',
		//'4'=>'소개(실장)',
		//'6'=>'소개(고객)',
		//'5'=>'소개(직원)',
		// 20170215 kruddo : 소개 목록 간소화 2+3->1, 4+5->5, 6->6
);

$config['all_path'] = array (
		'L'=>'온라인',
		'T'=>'전화',
		'W'=>'워킹',
		'E'=>'기존고객',
		'Z'=>'메디코스(기존)',
		'1'=>'소개(원장)',
		'6'=>'소개(고객)',
		'5'=>'소개(직원)',
		'G'=>'에이전시',
		//'R'=>'리얼모델',			// 20170224 kruddo : 리얼모델 삭제
		'P'=>'실시간상담',
		'O'=>'온라인상담',
		'K'=>'카카오톡',
		'I'=>'직원',
		'Q'=>'기타1',
		'A'=>'기타2'

		// 20170215 kruddo : 소개 목록 간소화 2+3->1, 4+5->5, 6->6
		//'1'=>'소개(박원장)',
		//'2'=>'소개(진원장)',
		//'3'=>'소개(신원장)',
		//'4'=>'소개(실장)',
		//'6'=>'소개(고객)',
		//'5'=>'소개(직원)',
		// 20170215 kruddo : 소개 목록 간소화 2+3->1, 4+5->5, 6->6
);


$config['type'] = array (
		'W'=>'WEB',
		'M'=>'MOBILE'
);

$config['db_status'] = array('0'=>'대기', '-2'=>'검토', '1'=>'완료', '9'=>'보류', '8'=>'중복');

$config['category'] = array (
	'1001'=>'입술&인중성형',
        '1017'=>'입꼬리',
        '1013'=>'줄기세포가슴성형',
		'1018'=>'처진가슴교정',
        '1016'=>'턱끝성형',
        '1006'=>'귀성형',
        '1004'=>'리프팅&동안성형',
        '1014'=>'힙업성형',
        '1010'=>'모발이식',
        '1011'=>'쁘띠성형',
        '1012'=>'피부케어',
        '1009'=>'남자성형',
        '1007'=>'눈성형',
        '1008'=>'코성형',
        '1002'=>'가슴성형',
        '1003'=>'안면윤곽',
        '1005'=>'바디성형',
        '1015'=>'지방흡입/이식',
        '9999'=>'기타'

);


$config['menu'] = array('1'=>'영업관리', '2'=>'병원관리','3'=>'업무관리', '4'=>'경영지원', '5'=>'통계', '0'=>'설정');
$config['position_code'] = array (
		'99'=>'대표이사',
		'97'=>'이사',
		'96'=>'부장',
		'95'=>'차장',
		'94'=>'과장',
		'93'=>'대리',
		'92'=>'주임',
		'91'=>'사원',
		'52'=>'상담팀장',
		'51'=>'상담실장',
		'20'=>'팀장',
		'21'=>'부팀장',
		'22'=>'팀원',
		'23'=>'원장',
		'10'=>'대표원장'
)
;
$config['duty_code'] = array (
		'9'=>'대표이사',
		'8'=>'총괄',
		'7'=>'팀장',
		'6'=>'부팀장',
		'5'=>'팀원',
		'2'=>'원장',
		'1'=>'대표원장'
);


$config['cst_status'] = array (
		'99'=>'수술완료',
		'98'=>'수술예정',
		'90'=>'수술취소',
		'52'=>'내원상담',
		'51'=>'내원예약',
		'50'=>'내원취소',
		'11'=>'진행중',
		'13'=>'예치금',
		'19'=>'상담완료',
		'21'=>'부재중1',
		'22'=>'부재중2',
		'23'=>'부재중3',
		'30'=>'결번',
		'00'=>'종료',
		'01'=>'재컨택',					// 20170306 kruddo : 대표님 요청 '재컨택' 추가
		'09'=>'사업장변경'
);

$config['sex'] = array (
		'F'=>'여',
		'M'=>'남'
);

$config['user_status'] = array (
		'1'=>'근무',
		'0'=>'퇴사',
		'2'=>'휴직'
);

$config['process_category'] = array (
		'자금출금',
		'자금이체',
		'자동이체',
		'잔액이체',
		'입금'
);
$config['account_type'] = array (
		'C'=>'현금',
		'A'=>'계좌'
);

$config['currency_type'] = array (
		'K'=>'-',
		'U'=>'USD',
		'C'=>'CNY'
);


$config['yoil'] = array ('일', '월', '화', '수', '목', '금', '토');
$config['doctor']['H000']['ezham'] = array('지용훈', '이현직', '최우경', '홍성재', '신문석');
$config['doctor']['H000']['klasseps'] = array('지용훈', '이현직', '최우경', '홍성재', '신문석');

$config['attendance']  = array(
	'10'=>'출근',
	'11'=>'휴일근무',
	'20'=>'오전반차',
	'21'=>'오후반차',
	'30'=>'결근',
	'31'=>'월차',
	'32'=>'연차',
	'33'=>'경조휴가',
	'34'=>'대체휴무',
	'35'=>'휴일',
	'36'=>'병가',
	'37'=>'공가',
	'38'=>'훈련',
	'99'=>'기타'
);

$config['attendance_settle'] = array(
	'10'=>array(
		'name'=>'휴가신청서',
		'attendance'=>array('32','37','38','33','20','21','99')
	),
	'20'=>array(
		'name'=>'결근사유서',
		'attendance'=>array('36','37','38','33','30','99')
	),
	'30'=>array(
		'name'=>'지각사유서',
		'attendance'=>array()
	),
	'40'=>array(
		'name'=>'근무신청서 ',
		'attendance'=>array('11')
	)
);

/*건들지마셈*/
$config['codeprinc'] = array (
		'100'=>'100(탁월)',
		'95'=>'95(탁월)',
		'90'=>'90(탁월)',
		'85'=>'85(우수)',
		'80'=>'80(우수)',
		'75'=>'75(양호)',
		'70'=>'70(양호)',
		'65'=>'65(미흡)',
		'60'=>'60(미흡)',
		'55'=>'55(부족)',
		'50'=>'50(부족)'
);


$config['nameyesno'] = array (
		'Y'=>'사용',
		'N'=>'중지'
);
$config['strexposure'] = array (
		'Y'=>'노출',
		'N'=>'미노출'
);

$config['order_status'] = array(
	'wait'=>'대기',
	'view'=>'확인',
	//'ing'=>'입고대기',
	//'done'=>'입고완료',
	'adjust'=>'입고신청',
	'reject'=>'입고신청거부',
	'approval'=>'경영진승인',
	'disapproval'=>'경영진반려',
	'cancel'=>'취소'
);
?>
